---
kind: property
id: P:Autodesk.Revit.DB.DividedSurface.NumberOfVGridlines
source: html/a5fff574-f64f-746e-8f1f-c1de57ff9699.htm
---
# Autodesk.Revit.DB.DividedSurface.NumberOfVGridlines Property

Get the number of V-gridlines used on the
surface.

## Syntax (C#)
```csharp
public int NumberOfVGridlines { get; }
```